Расш_СкидкиУНФ_Адаптация/src/Catalogs/УсловияПредоставленияСкидокНаценок/УсловияПредоставленияСкидокНаценок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="50d7c5f6-dac4-432a-8126-edc031f87c34">
  <name>УсловияПредоставленияСкидокНаценок</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Catalog>

Расш_СкидкиУНФ_Адаптация/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bea7f781-5f18-4219-997c-9a767fb284be">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="684049cc-bea4-46ee-b11f-a71286339275">
    <name>КатегорияНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eabbc395-20ec-4d94-8a18-9b2813338d54">
    <name>ИспользоватьХарактеристики</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Расш_СкидкиУНФ_Адаптация/src/Catalogs/УсловияПредоставленияСкидокНаценок/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
	
	
&НаСервере
Процедура Скидки_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ИмяКоманды = "Ск_ДобавитьНоменклатуруСХарактеристиками";
	Команда = Команды.Добавить(ИмяКоманды);
	Команда.Действие = ИмяКоманды;
	Команда.ИзменяетСохраняемыеДанные = Истина;
	Команда.Заголовок = "Добавить номенклатуру с характеристиками";
	
	Кнопка = Элементы.Добавить(ИмяКоманды,Тип("КнопкаФормы"),Элементы.ОтборПродажПоНоменклатуре.КоманднаяПанель);
	Кнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры
	
	
#КонецОбласти

#Область ОбработчикиКомандФормы
		
	&НаКлиенте
	Процедура Ск_ДобавитьНоменклатуруСХарактеристиками(Команда)
		ПараметрыОткрытия = Новый Структура("РежимВыбора, МножественныйВыбор, ЗакрыватьПриВыборе", Истина, Истина, Истина);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("Ск_ДобавитьНоменклатуруСХарактеристикамиЗавершение", ЭтотОбъект);
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект,,,, ОповещениеОЗакрытии);
		
	КонецПроцедуры
	
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Обработчик завершения выбора номенклатуры с характеристиками.
//
// Параметры:
//   РезультатЗакрытия - Массив из СправочникСсылка.Номенклатура - список номенклатуры для добавления.
//   ДополнительныеПараметры - Произвольный - дополнительные параметры, переданные при открытии формы.
//
	&НаКлиенте
	Процедура Ск_ДобавитьНоменклатуруСХарактеристикамиЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
		
		Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
			ДобавитьНоменклатуруСХарактеристикамиНасервере(РезультатЗакрытия);	
			Объект.Наименование = СформироватьАвтоНаименованиеНаКлиенте();
		КонецЕсли;
	
	КонецПроцедуры
	
	
// Добавляет номенклатуру с характеристиками в табличную часть "ОтборПродажПоНоменклатуре" на сервере.
//
// Параметры:
//   СписокТоваров - Массив из СправочникСсылка.Номенклатура - список номенклатуры для добавления.
//
	&НаСервере
	Процедура ДобавитьНоменклатуруСХарактеристикамиНасервере(СписокТоваров)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
		|	Номенклатура.ИспользоватьХарактеристики КАК ИспользоватьХарактеристики
		|ПОМЕСТИТЬ вт_Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&СписокТоваров)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_Номенклатура.Ссылка КАК Номенклатура,
		|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
		|	ИСТИНА КАК ХарактеристикиИспользуются
		|ИЗ
		|	вт_Номенклатура КАК вт_Номенклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО вт_Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
		|			И (НЕ ХарактеристикиНоменклатуры.ПометкаУдаления)
		|			И (НЕ ХарактеристикиНоменклатуры.Недействителен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт_Номенклатура.Ссылка,
		|	ХарактеристикиНоменклатуры.Ссылка,
		|	ИСТИНА
		|ИЗ
		|	вт_Номенклатура КАК вт_Номенклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО вт_Номенклатура.КатегорияНоменклатуры = ХарактеристикиНоменклатуры.Владелец
		|			И (НЕ ХарактеристикиНоменклатуры.ПометкаУдаления)
		|			И (НЕ ХарактеристикиНоменклатуры.Недействителен)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	вт_Номенклатура.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	ЛОЖЬ
		|ИЗ
		|	вт_Номенклатура КАК вт_Номенклатура
		|ГДЕ
		|	НЕ вт_Номенклатура.ИспользоватьХарактеристики
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	Характеристика
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("СписокТоваров", СписокТоваров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыПоиска = Новый Структура("Номенклатура, Характеристика", Выборка.Номенклатура, Выборка.Характеристика);
		НайденныеСстроки = Объект.ОтборПродажПоНоменклатуре.НайтиСтроки(ПараметрыПоиска);
		
		Если НайденныеСстроки.Количество() = 0 Тогда
			
		НоваяСтрока = Объект.ОтборПродажПоНоменклатуре.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);	
		Элементы.ОтборПродажПоНоменклатуре.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		
		КонецЕсли;
	
	КонецЦикла;
	

КонецПроцедуры	
#КонецОбласти
